# ColorSchemeLocation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ColorSchemeLocation Property
ParameterTypeId Class See Also
---
"Color Scheme Location"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ColorSchemeLocation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColorSchemeLocation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ColorSchemeLocation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace